modm-ext/archive-stmicro-svd/header_stm32l052c6t6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <baseAddress>0x40005c00</baseAddress>
      <registers>
        <register>
          <name>EP0R</name>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP1R</name>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP2R</name>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP3R</name>
          <addressOffset>0xc</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP4R</name>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP5R</name>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP6R</name>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP7R</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>CNTR</name>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>ISTR</name>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>FNR</name>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>DADDR</name>
          <addressOffset>0x4c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>BTABLE</name>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>LPMCSR</name>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>BCDR</name>
          <addressOffset>0x58</addressOffset>
          <size>0x10</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRS</name>
      <baseAddress>0x40006c00</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYNCOKIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCWARNIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCIE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOTRIMEN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWSYNC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIM</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RELOAD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FELIM</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SYNCDIV</name>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SYNCSRC</name>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCPOL</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYNCOKF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCWARNF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCERR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCMISS</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIMOVF</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEDIR</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FECAP</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYNCOKC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCWARNC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRC</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESYNCC</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
